In [6]:
people = {
    'first' : ['Yaqub', 'Muhsina', 'Abubakar', 'Taiwo'],
    'last' : ['Gaji', 'Abdulkareem', 'Abdulkareem', 'Olatunji'],
    'email': ['gaji@123.com', 'oyin@6.com', 'abdul@gmail.com', 'ola@gmail.ng']
}

In [7]:
import pandas as pd

In [8]:
df = pd.DataFrame(people)

In [9]:
df

      first         last            email
0     Yaqub         Gaji     gaji@123.com
1   Muhsina  Abdulkareem       oyin@6.com
2  Abubakar  Abdulkareem  abdul@gmail.com
3     Taiwo     Olatunji     ola@gmail.ng

In [11]:
# COmbining First and Last name into a single column
df['first'] + ' ' + df['last']

0              Yaqub Gaji
1     Muhsina Abdulkareem
2    Abubakar Abdulkareem
3          Taiwo Olatunji
dtype: object

In [12]:
df['full_name'] = df['first'] + ' ' + df['last']

In [14]:
# Now we can see that we have created a column for the 
# full_name
df

      first         last            email             full_name
0     Yaqub         Gaji     gaji@123.com            Yaqub Gaji
1   Muhsina  Abdulkareem       oyin@6.com   Muhsina Abdulkareem
2  Abubakar  Abdulkareem  abdul@gmail.com  Abubakar Abdulkareem
3     Taiwo     Olatunji     ola@gmail.ng        Taiwo Olatunji

In [15]:
# we can Use the 'apply' method in assigning a new column
# '.' notations can not be used to asssign a new column

REMOVING COLUMNS/ROWS

In [ ]:
# Using the 'drop' method to remove a column
# We need to set 'inplace=True' if we want it to change the 
# data permanently without the first and last name
df.drop(columns=['first', 'last'], inplace = True)

In [21]:
df

             email             full_name
0     gaji@123.com            Yaqub Gaji
1       oyin@6.com   Muhsina Abdulkareem
2  abdul@gmail.com  Abubakar Abdulkareem
3     ola@gmail.ng        Taiwo Olatunji

Reversing the process

In [22]:
# Using the 'split()' method
df['full_name'].str.split(' ')

0              [Yaqub, Gaji]
1     [Muhsina, Abdulkareem]
2    [Abubakar, Abdulkareem]
3          [Taiwo, Olatunji]
Name: full_name, dtype: object

In [23]:
# Expanding
df['full_name'].str.split(' ', expand=True)

          0            1
0     Yaqub         Gaji
1   Muhsina  Abdulkareem
2  Abubakar  Abdulkareem
3     Taiwo     Olatunji

In [24]:
# To access multiple columns we use 2 brackets [[]]
# And the innner bracket is the list of columns
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [25]:
# This is how to add and remove a column
df

             email             full_name     first         last
0     gaji@123.com            Yaqub Gaji     Yaqub         Gaji
1       oyin@6.com   Muhsina Abdulkareem   Muhsina  Abdulkareem
2  abdul@gmail.com  Abubakar Abdulkareem  Abubakar  Abdulkareem
3     ola@gmail.ng        Taiwo Olatunji     Taiwo     Olatunji

APPENDING ROWS

In [27]:
# without the usage of 'ignore_index=True' it will result
# in an error
df.append({'first': 'Tony'}, ignore_index=True)

C:\Users\YK Gaji\AppData\Local\Temp\ipykernel_3228\67547244.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first': 'Tony'}, ignore_index=True)

             email             full_name     first         last
0     gaji@123.com            Yaqub Gaji     Yaqub         Gaji
1       oyin@6.com   Muhsina Abdulkareem   Muhsina  Abdulkareem
2  abdul@gmail.com  Abubakar Abdulkareem  Abubakar  Abdulkareem
3     ola@gmail.ng        Taiwo Olatunji     Taiwo     Olatunji
4              NaN                   NaN      Tony          NaN

USING A SLIGHTLY MODIFIED DATA TO EXPLAIN

In [29]:
people = {
    'first' : ['Yaqub', 'Abubakar'],
    'last' : ['Dawodu', 'Ayanda'],
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}

df2 = pd.DataFrame(people)

In [30]:
df2

      first    last               email
0     Yaqub  Dawodu  IronMan@avenge.com
1  Abubakar  Ayanda      Cap@avenge.com

Adding a Data frame to an existing Data Frame

In [34]:
# Don't forget they have conflicting indexes
# Also the rows and columns are not the same
# So we use the 'ignore_index=True' to override the data
# The 'sort=False' is used to not sort the data frame
df.append(df2, ignore_index=True, sort=False)

C:\Users\YK Gaji\AppData\Local\Temp\ipykernel_3228\3326382358.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True, sort=False)

                email             full_name     first         last
0        gaji@123.com            Yaqub Gaji     Yaqub         Gaji
1          oyin@6.com   Muhsina Abdulkareem   Muhsina  Abdulkareem
2     abdul@gmail.com  Abubakar Abdulkareem  Abubakar  Abdulkareem
3        ola@gmail.ng        Taiwo Olatunji     Taiwo     Olatunji
4  IronMan@avenge.com                   NaN     Yaqub       Dawodu
5      Cap@avenge.com                   NaN  Abubakar       Ayanda

In [38]:
# Saving the data requres re-assigning not using 'inplace=True'
# The 'append' method doesn't have 'inplace=True'

In [39]:
df = df.append(df2, ignore_index=True, sort=False)

C:\Users\YK Gaji\AppData\Local\Temp\ipykernel_3228\3370980109.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True, sort=False)

In [40]:
df

                email             full_name     first         last
0        gaji@123.com            Yaqub Gaji     Yaqub         Gaji
1          oyin@6.com   Muhsina Abdulkareem   Muhsina  Abdulkareem
2     abdul@gmail.com  Abubakar Abdulkareem  Abubakar  Abdulkareem
3        ola@gmail.ng        Taiwo Olatunji     Taiwo     Olatunji
4  IronMan@avenge.com                   NaN     Yaqub       Dawodu
5      Cap@avenge.com                   NaN  Abubakar       Ayanda
6  IronMan@avenge.com                   NaN     Yaqub       Dawodu
7      Cap@avenge.com                   NaN  Abubakar       Ayanda

REMOVING ROWS

In [41]:
df.drop(index=4)

                email             full_name     first         last
0        gaji@123.com            Yaqub Gaji     Yaqub         Gaji
1          oyin@6.com   Muhsina Abdulkareem   Muhsina  Abdulkareem
2     abdul@gmail.com  Abubakar Abdulkareem  Abubakar  Abdulkareem
3        ola@gmail.ng        Taiwo Olatunji     Taiwo     Olatunji
5      Cap@avenge.com                   NaN  Abubakar       Ayanda
6  IronMan@avenge.com                   NaN     Yaqub       Dawodu
7      Cap@avenge.com                   NaN  Abubakar       Ayanda

In [47]:
# Dropping rows with conditions
# Dropping rows where last name = 'Abdulkareem'
filt = df['last'] == 'Abdulkareem'
df.drop(index=df[filt].index)

                email       full_name     first      last
0        gaji@123.com      Yaqub Gaji     Yaqub      Gaji
3        ola@gmail.ng  Taiwo Olatunji     Taiwo  Olatunji
4  IronMan@avenge.com             NaN     Yaqub    Dawodu
5      Cap@avenge.com             NaN  Abubakar    Ayanda
6  IronMan@avenge.com             NaN     Yaqub    Dawodu
7      Cap@avenge.com             NaN  Abubakar    Ayanda